from django import forms

#index.htmlに表示する、目標体型の選択肢
GOAL = (
    ('smart', 'スマート体型'),
    ('thick', 'ガッチリ体型'),
)

#index.htmlに表示する、性別の選択肢
SEX = (
    ('women', '女性'),
    ('men', '男性'),
)

#index.htmlに表示する、年齢の選択肢
OLD = (
    ('18', '18歳'),
    ('19', '19歳'),
    ('20', '20歳'),
    ('21', '21歳'),
    ('22', '22歳'),
    ('23', '23歳'),
    ('24', '24歳'),
    ('25', '25歳'),
    ('26', '26歳'),
    ('27', '27歳'),
    ('28', '28歳'),
    ('29', '29歳'),
    ('30', '30歳'),
    ('31', '31歳'),
    ('32', '32歳'),
    ('33', '33歳'),
    ('34', '34歳'),
    ('35', '35歳'),
    ('36', '36歳'),
    ('37', '37歳'),
    ('38', '38歳'),
    ('39', '39歳'),
    ('40', '40歳'),
    ('41', '41歳'),
    ('42', '42歳'),
    ('43', '43歳'),
    ('44', '44歳'),
    ('45', '45歳'),
    ('46', '46歳'),
    ('47', '47歳'),
    ('48', '48歳'),
    ('49', '49歳'),
    ('50', '50歳'),
    ('51', '51歳'),
    ('52', '52歳'),
    ('53', '53歳'),
    ('54', '54歳'),
    ('55', '55歳'),
)

#index.htmlに表示する、身長の選択肢
HEIGHT = (
    ('145', '145cm'),
    ('146', '146cm'),
    ('147', '147cm'),
    ('148', '148cm'),
    ('149', '149cm'),
    ('150', '150cm'),
    ('151', '151cm'),
    ('152', '152cm'),
    ('153', '153cm'),
    ('154', '154cm'),
    ('155', '155cm'),
    ('156', '156cm'),
    ('157', '157cm'),
    ('158', '158cm'),
    ('159', '159cm'),
    ('160', '160cm'),
    ('161', '161cm'),
    ('162', '162cm'),
    ('163', '163cm'),
    ('164', '164cm'),
    ('165', '165cm'),
    ('166', '166cm'),
    ('167', '167cm'),
    ('168', '168cm'),
    ('169', '169cm'),
    ('170', '170cm'),
    ('171', '171cm'),
    ('172', '172cm'),
    ('173', '173cm'),
    ('174', '174cm'),
    ('175', '175cm'),
    ('176', '176cm'),
    ('177', '177cm'),
    ('178', '178cm'),
    ('179', '179cm'),
    ('180', '180cm'),
    ('181', '181cm'),
    ('182', '182cm'),
    ('183', '183cm'),
    ('184', '184cm'),
    ('185', '185cm'),
)

#index.htmlに表示する、体重の選択肢
WEIGHT = (
    ('40', '40kg'),
    ('41', '41kg'),
    ('42', '42kg'),
    ('43', '43kg'),
    ('44', '44kg'),
    ('45', '45kg'),
    ('46', '46kg'),
    ('47', '47kg'),
    ('48', '48kg'),
    ('49', '49kg'),
    ('50', '50kg'),
    ('51', '51kg'),
    ('52', '52kg'),
    ('53', '53kg'),
    ('54', '54kg'),
    ('55', '55kg'),
    ('56', '56kg'),
    ('57', '57kg'),
    ('58', '58kg'),
    ('59', '59kg'),
    ('60', '60kg'),
    ('61', '61kg'),
    ('62', '62kg'),
    ('63', '63kg'),
    ('64', '64kg'),
    ('65', '65kg'),
    ('66', '66kg'),
    ('67', '67kg'),
    ('68', '68kg'),
    ('69', '69kg'),
    ('70', '70kg'),
    ('71', '71kg'),
    ('72', '72kg'),
    ('73', '73kg'),
    ('74', '74kg'),
    ('75', '75kg'),
    ('76', '76kg'),
    ('77', '77kg'),
    ('78', '78kg'),
    ('79', '79kg'),
    ('80', '80kg'),
)

class SelectForm(forms.Form):
    """index.htmlから選択されたデータを、viewに返せるようにする
    
    Returns:
        list: indexページで選択されたデータ
    """
    goal = forms.ChoiceField(
        choices=GOAL, required=False, widget=forms.Select(attrs={'class': 'cp_ipselect01 cp_sl01'}))
    sex = forms.ChoiceField(
        choices=SEX, required=False, widget=forms.Select(attrs={'class': 'cp_ipselect02 cp_sl02'}))
    old = forms.ChoiceField(
        choices=OLD, required=False, widget=forms.Select(attrs={'class': 'cp_ipselect03 cp_sl03'}))
    height = forms.ChoiceField(
        choices=HEIGHT, required=False, widget=forms.Select(attrs={'class': 'cp_ipselect04 cp_sl04'}))
    weight = forms.ChoiceField(
        choices=WEIGHT, required=False, widget=forms.Select(attrs={'class': 'cp_ipselect05 cp_sl05'}))

    def clean(self):
        # 上記のデータをリスト型に、それぞれ取り出す
        data = super().clean()
        return data     
